export enum ModalErrors {
  RATE = 'Оценка не была отправлена. Попробуйте позже!',
  CHANGES = 'Изменения не были сохранены. Попробуйте позже!',
  AVATAR = 'Что-то пошло не так, фото не сохранилось. Попробуйте позже!',
  BOOKING_DELETE = 'Не удалось снять бронирование книги. Попробуйте позже!',
  BOOKING = 'Что-то пошло не так, книга не забронирована. Попробуйте позже!',
}

export enum ModalSuccess {
  RATE = 'Спасибо, что нашли время оценить книгу!',
  EDIT_RATE = 'Спасибо, что нашли время изменить оценку!',
  AVATAR = 'Фото успешно сохранено!',
  BOOKING = 'Книга забронирована. Подробности можно посмотреть на странице Профиль',
  BOOKING_DELETE = 'Бронирование книги успешно отменено!',
  CHANGES = 'Изменения успешно сохранены!',
}
